Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: perlsource - A guide to the Perl source tree
es: perlsource - Guía del árbol de código fuente de Perl

source: perlstyle Perl style guide
es: perlstyle Guía de estilo

source: perlstyle - Perl style guide
es: perlstyle - Guía de estilo de Perl

source: perlsub Perl subroutines
es: perlsub Subrutinas

source: perlsymbian Perl notes for Symbian
es: perlsymbian Notas para Symbian

source: perlsyn Perl syntax
es: perlsyn Sintaxis

source: perlthrtut Perl threads tutorial
es: perlthrtut Tutorial de uso de hilos de ejecución

source: perltie Perl objects hidden behind simple variables
es: perltie Objetos Perl ocultos en variables simples

source: perltoc Perl documentation table of contents
es: perltoc Tabla de contenido de la documentación de Perl

source: perltodo Perl things to do
es: perltodo Tareas pendientes

source: perltodo - Perl TO-DO List
es: perltodo - Lista de tareas pendientes de Perl

source: perltooc Perl OO tutorial, part 2
es: perltooc Programación orientada a objetos, parte 2

source: perltooc - This document has been deleted
es: perltooc - Documento suprimido

source: perltoot Perl OO tutorial, part 1
es: perltoot Programación orientada a objetos, parte 1

source: perltoot - This document has been deleted
es: perltoot - Documento suprimido

source: perltrap Perl traps for the unwary
es: perltrap Trampas para los incautos

source: perltru64 Perl notes for Tru64
es: perltru64 Notas para Tru64

source: perltw Perl for Traditional Chinese (in Big5)
es: perltw Perl para chino tradicional (en Big5)

source: perlunicode Perl Unicode support
es: perlunicode Compatibilidad con Unicode

source: perlunifaq Perl Unicode FAQ
es: perlunifaq Preguntas más frecuentes sobre Unicode

source: perlunifaq - Perl Unicode FAQ
es: perlunifaq - Preguntas más frecuentes sobre Unicode en Perl

source: perluniintro Perl Unicode introduction
es: perluniintro Introducción a Unicode

source: perluniprops Index of Unicode Version 6.0.0 properties in Perl
es: perluniprops Índice de propiedades de Unicode versión 6.0.0

source: perlunitut Perl Unicode tutorial
es: perlunitut Tutorial de Unicode

source: perlunitut - Perl Unicode Tutorial
es: perlunitut - Tutorial de Unicode en Perl

source: perlutil utilities packaged with the Perl distribution
es: perlutil Utilidades incluidas en una distribución Perl

source: perlutil - utilities packaged with the Perl distribution
es: perlutil - Utilidades incluidas en la distribución de Perl

source: perluts Perl notes for UTS
es: perluts Notas para UTS

source: perlvar Perl predefined variables
es: perlvar Variables predefinidas

source: perlvmesa Perl notes for VM/ESA
es: perlvmesa Notas para VM/ESA

source: perlvms Perl notes for VMS
es: perlvms Notas para VMS

source: perlvos Perl notes for Stratus VOS
es: perlvos Notas para Stratus VOS

source: perlwin32 Perl notes for Windows
es: perlwin32 Notas para Windows

source: perlxs Perl XS application programming interface
es: perlxs Interfaz de programación de aplicaciones XS

source: perlxstut Perl XS tutorial
es: perlxstut Tutorial de XS

source: pm.org?
es: ¿Y pm.org?

source: pos($string) = 1;
es: pos($cadena) = 1;

# print "$2 follows $1. ";
source: print "$2 follows $1.\n";
es: print "$2 sigue a $1.\n";

# print "1: got $1 " if $x =~ /^(ABC)(?!123)/;
source: print "1: got $1\n" if $x =~ /^(ABC)(?!123)/;
es: print "1: se obtiene $1\n" if $x =~ /^(ABC)(?!123)/;

# print "2: got $1 " if $y =~ /^(ABC)(?!123)/;
source: print "2: got $1\n" if $y =~ /^(ABC)(?!123)/;
es: print "2: se obtiene $1\n" if $y =~ /^(ABC)(?!123)/;

# print "3: got $1 " if $x =~ /^(D*)(?!123)/;
source: print "3: got $1\n" if $x =~ /^(\D*)(?!123)/;
es: print "3: se obtiene $1\n" if $x =~ /^(\D*)(?!123)/;

# print "4: got $1 " if $y =~ /^(D*)(?!123)/;
source: print "4: got $1\n" if $y =~ /^(\D*)(?!123)/;
es: print "4: se obtiene $1\n" if $y =~ /^(\D*)(?!123)/;

# print "5: got $1 " if $x =~ /^(D*)(?=d)(?!123)/;
source: print "5: got $1\n" if $x =~ /^(\D*)(?=\d)(?!123)/;
es: print "5: se obtiene $1\n" if $x =~ /^(\D*)(?=\d)(?!123)/;

# print "6: got $1 " if $y =~ /^(D*)(?=d)(?!123)/;
source: print "6: got $1\n" if $y =~ /^(\D*)(?=\d)(?!123)/;
es: print "6: se obtiene $1\n" if $y =~ /^(\D*)(?=\d)(?!123)/;

# print "Beginning is , number is . ";
source: print "Beginning is , number is .\n";
es: print "El comienzo es , número es .\n";

# print "Count=$count ";
source: print "Count=$count\n";
es: print "Contador=$contador\n";

# print "Darwin's First Name is ", $scientists{"Darwin"}, " ";
source: print "Darwin's First Name is ", $scientists{"Darwin"}, "\n";
es: print "El nombre de Darwin es", $cientificos{"Darwin"}, "\n";

source: print "Hello
es: print "Hola

# print "Hello, $name "; # works fine
source: print "Hello, $name\n"; # works fine
es: print "Hola, $nombre\n"; # funciona correctamente

source: print "Hello, world";
es: print "Hola a todos";

# print "Hello, world ";
source: print "Hello, world\n";
es: print "Hola a todos\n";

# print "Hostname is $2 ";
source: print "Hostname is $2\n";
es: print "El nombre de host es $2\n";

# print "Its title is ", $self->title, " ";
source: print "Its title is ", $self->title, "\n";
es: print "Título: ", $self->titulo, "\n";

source: print "Just read in this line: $_";
es: print "Acabo de leer esta línea: $_";

# print "LA LA LA " while 1; # loops forever
source: print "LA LA LA\n" while 1; # loops forever
es: print "LA LA LA\n" while 1; # bucle sin fin

# print "Scalars begin with a $variables->{'scalar'}->{'sigil'} ";
source: print "Scalars begin with a $variables->{'scalar'}->{'sigil'}\n";
es: print "Los escalares empiezan por $variables->{'escalar'}->{'sigilo'}\n";

# print "Starting analysis " if $verbose;
source: print "Starting analysis\n" if $verbose;
es: print "Iniciando análisis\n" if $verbose;

# print "The Third Element is", $myarray[2], " ";
source: print "The Third Element is", $myarray[2], "\n";
es: print "El tercer elemento es", $miarray[2], "\n";

# print "The animal is $animal ";
source: print "The animal is $animal\n";
es: print "El animal es $animal\n";

# print "The price is $Price. "; # interpolated
source: print "The price is $Price.\n"; # interpolated
es: print "El precio es $precio.\n"; # se interpola

# print "The square of $answer is ", $answer * $answer, " ";
source: print "The square of $answer is ", $answer * $answer, "\n";
es: print "El cuadrado de $respuesta es ", $respuesta * $respuesta, "\n";

# print "The value of $key is $hash{$key} ";
source: print "The value of $key is $hash{$key}\n";
es: print "El valor de $clave es $hash{$clave}\n";

# print "This element is $_ ";
source: print "This element is $_\n";
es: print "Este elemento es $_\n";

# print "This file is at ", $self->path, " ";
source: print "This file is at ", $self->path, "\n";
es: print "Ruta del archivo: ", $self->ruta, "\n";

# print "Username is $1 ";
source: print "Username is $1\n";
es: print "El nombre de usuario es $1\n";

source: print "We have no bananas" unless $bananas;
es: print "No quedan plátanos" unless $platanos;

# print "We use ${who}speak when ${who}'s here. ";
source: print "We use ${who}speak when ${who}'s here.\n";
es: print "Pasamos a hablar en el idiolecto ${usuario}nés cuando el australiano chilla '${usuario}'s coming!'.\n";

source: print "Yow!" if $zippy;
es: print "¡Caramba!" if $zippy;

source: print "Yow!";
es: print "¡Caramba!";

# print "Yup, no 123 in $_ ";
source: print "Yup, no 123 in $_\n";
es: print "Efectivamente, no hay 123 en $_\n";

# print "got ";
source: print "got \n";
es: print "se obtiene \n";

# print "in ", __PACKAGE__, ": $name is '$name' ";
source: print "in ", __PACKAGE__, ": \$name is '$name'\n";
es: print "en ", __PACKAGE__, ": \$nombre es '$nombre'\n";

# print "match: <$&> " while 'foo' =~ m{ o?
source: print "match: <$&>\n" while 'foo' =~ m{ o?
es: print "coincidencia: <$&>\n" while 'foo' =~ m{ o?

source: print $animals[0]; # prints "camel"
es: print $animales[0]; # imprime "camello"

source: print $animals[1]; # prints "llama"
es: print $animales[1]; # imprime "llama"

source: print $foo; # Prints '1'!
es: print $foo; # Imprime '1'

source: print $list[$_] foreach 0 ..
es: print $lista[$_] foreach 0 ..

source: print $log $logmessage;
es: print $registro $mensaje_registro;

source: print $logfile $logmessage;
es: print $registro $mensaje_registro;

source: print $mixed[$#mixed]; # last element, prints 1.23
es: print $mezcla[$#mezcla]; # último elemento, imprime 1.23

source: print $out $record;
es: print $salida $registro;

# print $prefix, ", ", $self->path, " ";
source: print $prefix, ", ", $self->path, "\n";
es: print $prefijo, ", ", $self->ruta, "\n";

source: print $time->epoch();
es: print $hora->tiempo_Unix();

source: print $time->epoch;
es: print $hora->tiempo_Unix();

source: print $x; # prints "foo"
es: print $x; # imprime "foo"

source: print $y; # prints nothing; $y has fallen out of scope
es: print $y; # no imprime nada; $y está fuera del ámbito

source: print $y; # prints "bar"
es: print $y; # imprime "bar"

# print 'Hello, $name '; # prints $name literally
source: print 'Hello, $name\n'; # prints $name\n literally
es: print 'Hola, $nombre\n'; # imprime $nombre\n literalmente

source: print 'Hello, world';
es: print 'Hola a todos';

# print 'You gave me ', *{$glob}{PACKAGE}, '::', *{$glob}{NAME}, " ";
source: print 'You gave me ', *{$glob}{PACKAGE}, '::', *{$glob}{NAME}, "\n";
es: print 'Recibí ', *{$glob}{PACKAGE}, '::', *{$glob}{NAME}, "\n";

source: print 102.111.111; # same
es: print 102.111.111; # lo mismo

# print PASSWD "${who}::0:0:Superuser:/:/bin/perl ";
source: print PASSWD "${who}::0:0:Superuser:/:/bin/perl\n";
es: print PASSWD "${usuario}::0:0:Superuser:/:/bin/perl\n";

source: print STDERR "Awake!
es: print STDERR "¡Despierta!

# print STDERR "This is your final warning. ";
source: print STDERR "This is your final warning.\n";
es: print STDERR "Ésta es la última advertencia.\n";

source: print blessed( $bar ); # prints "Class"
es: print blessed( $bar ); # imprime "Clase"

source: print blessed( $bar ); # prints undef
es: print blessed( $bar ); # imprime undef

source: print blessed($hostname); # File
es: print blessed($nombre_host); # Archivo

source: print if $printit;
es: print if $imprimir;

source: print v102.111.111; # prints "foo"
es: print v102.111.111; # imprime en pantalla "foo"

source: print v9786; # prints SMILEY, "\x{263a}"
es: print v9786; # imprime en pantalla un emoticono, "\x{263a}"

source: print { $barfh } $_ while <$foofh>;
es: print { $fh_B } $_ while <$fh_A>;

source: print {$fh} $binary;
es: print {$fh} $binario;

source: print {$fh} $self->data() or die $!;
es: print {$archivo} $self->datos() or die $!;

# print("Hello, world ");
source: print("Hello, world\n");
es: print("Hola a todos\n");

source: print; # prints contents of $_ by default
es: print; # imprime el contenido de $_ de manera predeterminada

source: printf "%-12s ", $pat;
es: printf "%-12s ", $patron;

# printf "%-8s %s ", $user, $home;
source: printf "%-8s %s\n", $user, $home;
es: printf "%-8s %s\n", $usuario, $inicio;

source: prints
es: imprime

source: prints:
es: imprime:

source: private_sv = MRO_GET_PRIVATE_DATA(meta, &my_mro_alg);
es: private_sv = MRO_GET_PRIVATE_DATA(meta, &mi_alg_mro);

source: program written in a platform-dependent language might break if you change any of: machine, operating system, libraries, compiler, or system configuration.
es: programa escrito en un lenguaje dependiente de la plataforma puede no funcionar si se cambia alguno de los elementos siguientes: el equipo, el sistema operativo, las bibliotecas, el compilador o la configuración del sistema.

source: range operator (creates a list of numbers)
es: operador de intervalo (crea una lista de números)

source: rather than:
es: en lugar de:

source: regular expression enhancements
es: mejoras de las expresiones regulares

source: repetition of the previous word, assuming the C</x> modifier, and no C</i> modifier outside this group.
es: (también de mayúsculas y minúsculas) de la palabra anterior, suponiendo que se usa el modificador C</x>, y no el modificador C</i>, fuera de este grupo.

source: require "SomeModule.pm";
es: require "MiModulo.pm";

source: require Cwd; # make Cwd:: accessible
es: require Cwd; # hace Cwd:: accesible

source: require SomeModule;
es: require MiModulo;

source: require myint;
es: require entero;

source: results in C<< <><b><><a><><r><> >>.
es: produce C<< <><b><><a><><r><> >>.

source: return $class->SUPER::new(@_);
es: return $clase->SUPER::new(@_);

source: return $fh;
es: return $archivo;

source: return $hinthash->{"myint/in_effect"};
es: return $hash_pistas->{"entero/in_effect"};

source: return $result;
es: return $resultado;

source: return $self->{$called};
es: return $self->{$llamado};

source: return $self->{path};
es: return $self->{ruta};

source: return $time_for{$self};
es: return $hora_para{$self};

source: return *FH;
es: return *ARCHIVO;

source: return bless \$time, $class;
es: return bless \$hora, $clase;

source: return bless {}, $class;
es: return bless {}, $clase;

source: roll-your-own magic variables (including multiple simultaneous DBM implementations)
es: permite al usuario crear sus propias "variables mágicas" (incluidas varias implementaciones simultáneas de DBM)

source: s/(\d+)/ \1 + 1 /eg; # causes warning under -w
es: s/(\d+)/ \1 + 1 /eg; # provoca una advertencia con -w

source: s/(\w+)/\u\L$1/g; # "titlecase" words
es: s/(\w+)/\u\L$1/g; # escribir letras iniciales en mayúsculas

source: s/\s+$//; # trim trailing whitespace
es: s/\s+$//; # quitar espacios finales

source: s/^([^ ]*) *([^ ]*)/$2 $1/; # swap first two words
es: s/^([^ ]*) *([^ ]*)/$2 $1/; # intercambia las dos primeras palabras

source: s/^\s+//; # trim leading whitespace
es: s/^\s+//; # quitar espacios iniciales

source: s/foo/bar/; # replaces foo with bar in $_
es: s/foo/bar/; # reemplaza foo por bar en $_

source: save $file;
es: guardar $archivo;

source: say $+ {a}; # Prints '12'
es: say $+ {a}; # Imprime '12'

source: say $+ {b}; # *Also* prints '12'.
es: say $+ {b}; # *También* imprime '12'.

source: say 'Prepare to rock';
es: say 'Preparado para el rock';

source: say scalar @captures;
es: say scalar @capturas;

source: scalar @array ARRAY @array[0, 2] @hash{'a', 'b'}
es: escalar @array ARRAY @array[0, 2] @hash{'a', 'b'}

source: scalar => { description => "single item", sigil => '$', },
es: escalar => { descripcion => "elemento individual", sigilo => '$', },

source: scalar(@whatever) == $#whatever + 1;
es: scalar(@algo) == $#algo + 1;

source: should match both a single and a double "s", since C<\xDF> (on ASCII platforms) matches "ss".
es: debe detectar tanto una "s" simple como una "s" doble, ya que C<\xDF> coincide con "ss" (en plataformas ASCII).

source: so instead of this:
es: así que en vez de esto:

source: spicy tomato
es: tomate especiado

source: stat localtime caller SPECIAL VARIABLES
es: stat localtime caller VARIABLES ESPECIALES

source: statements;
es: instrucciones;

source: strndup(p, n) savepvn(p, n) (Hey, strndup doesn't exist!)
es: strndup(p, n) savepvn(p, n) (Atención: strndup no existe)

source: strtod(s, &p) Nothing.
es: strtod(s, &p) Ninguna.

source: sub DESTROY { } # see below
es: sub DESTROY { } # ver a continuación

source: sub Some_package::foo {
es: sub Un_paquete::foo {

source: sub Some_package::foo { ... } # &foo defined in Some_package
es: sub Un_paquete::foo { ... } # &foo definida en Un_paquete

source: sub convert {
es: sub convertir {

source: sub epoch {
es: sub tiempo_Unix {

source: sub identify_typeglob {
es: sub identificar_typeglob {

source: sub invalid { die "/$_[0]/: invalid escape '\\$_[1]'"}
es: sub no_valido { die "/$_[0]/: escape no válido '\\$_[1]'"}

source: sub load {
es: sub cargar {

source: sub logger {
es: sub registrador {

source: sub myopen {
es: sub miopen {

source: sub newopen {
es: sub nuevoopen {

source: sub path {
es: sub ruta {

source: sub print_info {
es: sub imprimir_info {

source: sub save {
es: sub guardar {

source: sub speak {
es: sub decir {

source: sub square {
es: sub cuadrado {

source: sub turn_off {
es: sub apagar {

source: sub turn_on {
es: sub encender {

source: subroutines can now be overridden, autoloaded, and prototyped
es: subrutinas que se pueden reemplazar, cargar automáticamente y prototipar

source: support for Unicode, internationalization, and localization
es: compatibilidad con Unicode, internacionalización y localización

source: support for light-weight processes (threads)
es: compatibilidad con procesos ligeros (hilos de ejecución)

source: switched version numbers so the book could refer to 4.000.
es: cambiamos los números de versión para que el libro pudiera hacer referencia a la versión 4.000.

source: sys/libcall error
es: error de sys/libcall

source: system "echo $temp";
es: system "echo $temporal";

source: system(s) Don't.
es: system(s) No la use.

source: t/op/pack.t has a sensible ok() function, but if it didn't we could use the one from t/test.pl.
es: t/op/pack.t tiene una función ok() adecuada, pero si no la tuviera, podríamos usar la de t/test.pl.

source: tar/extract/verbose Your_Module.tar
es: tar/extract/verbose Mi_Modulo.tar

source: temporarily makes $Here::blue an alias for $There::green, but doesn't make @Here::blue an alias for @There::green, or %Here::blue an alias for %There::green, etc. See L<perlmod/"Symbol Tables"> for more examples of this.
es: hace que $este::azul sea temporalmente un alias de $ese::verde, pero no hace que @este::azul sea un alias de @ese::verde, o que %este::azul sea un alias de %ese::verde, etc. Encontrará más ejemplos en la sección "Tablas de símbolos" de L<perlmod>.

source: that there are many different character sets and encodings, and that your program has to be explicit about them.
es: que hay muchos juegos de caracteres y codificaciones distintos, que debe utilizar explícitamente en su programa.

source: the integer operation provides scalar context for the <> operator, which responds by reading one line from STDIN and passing it back to the integer operation, which will then find the integer value of that line and return that.
es: la operación int establece un contexto de escalar para el operador <>, que responde leyendo una sola línea de STDIN y pasándosela a la operación int, que a su vez calcula el valor entero de esa línea y lo devuelve.

source: the key 12345 will get stored in the DBM database as the 5 byte string "12345".
es: la clave 12345 se almacenará en la base de datos DBM como una cadena de 5 bytes, "12345".

source: the output produced should be the following:
es: debe generar la siguiente salida:

source: the pattern explicitly mentions a code point that is above 255 (say by C<\x{100}>); or
es: el patrón menciona explícitamente un código de carácter que está por encima de 255 (por ejemplo, C<\x{100}>); o

source: the pattern is encoded in UTF-8; or
es: el patrón está codificado en UTF-8; o

source: the pattern uses a Unicode name (C<\N{...}>); or
es: el patrón usa un nombre Unicode (C<\N{...}>); o

source: the pattern uses a Unicode property (C<\p{...}>)
es: el patrón usa una propiedad Unicode (C<\p{...}>)

source: the target string is encoded in UTF-8; or
es: la cadena de comparación está codificada en UTF-8; o

source: the user will see something like this:
es: el usuario verá algo similar a:

source: then any bareword that would NOT be interpreted as a subroutine call produces a compile-time error instead.
es: cualquier palabra suelta que NO se pueda interpretar como una llamada de subrutina, generará un error en tiempo de compilación.

source: then the sort operation provides list context for <>, which will proceed to read every line available up to the end of file, and pass that list of lines back to the sort routine, which will then sort those lines and return them as a list to whatever the context of the sort was.
es: entonces la operación sort establece un contexto de lista para <>, el cual procede a leer todas las líneas disponibles hasta alcanzar el final del archivo, y pasa esa lista de líneas a la subrutina sort, que ordena las líneas y las devuelve como una lista al contexto en que se use sort.

source: title => 'My Body Is a Cage',
es: titulo => 'Soy minero',

source: to get Unicode rules, as the C<\L> in the former (but not necessarily the latter) would also use Unicode rules.
es: para aplicar reglas de Unicode, ya que con esta característica C<\L> también usará las reglas de Unicode (pero no las usará necesariamente en la sustitución anterior).

source: to give the output
es: devuelva el siguiente resultado:

source: to install it locally.
es: para instalarlo localmente.

source: to remove all ignored untracked files, such as build and test byproduct, but leave any manually created files alone.
es: para eliminar todos los archivos sin seguimiento ignorados, como los creados al compilar o realizar pruebas, conservando los archivos creados manualmente.

source: trials for 5.004_05.
es: Pruebas para 5.004_05.

source: unless ( condition ) {
es: unless ( condición ) {

source: unlink $filename;
es: unlink $archivo;

source: until ( condition ) {
es: until ( condición ) {

source: unzip Your-Module.zip
es: unzip Mi-Modulo.zip

source: use C<BE<lt>E<gt>> for commands names like B<cat> or B<grep>.
es: usar C<BE<lt>E<gt>> para nombres de comandos, como B<cat> o B<grep>.

source: use C<CE<lt>E<gt>> for function, variable and module names (and more generally anything that can be considered part of code, like filehandles or specific values).
es: usar C<CE<lt>E<gt>> para nombres de funciones, variables y módulos (y, de manera más general, cualquier cosa que se pueda considerar que forma parte del código, como identificadores de archivos o valores específicos).

source: use C<FE<lt>E<gt>> or C<CE<lt>E<gt>> for file names.
es: usar C<FE<lt>E<gt>> o C<CE<lt>E<gt>> para nombres de archivos.

source: use Cwd; # import names from Cwd::
es: use Cwd; # importa nombres de Cwd::

source: use Module ();
es: use Modulo ();

source: use Module LIST;
es: use Modulo LISTA;

source: use Module;
es: use Modulo;

source: use MyMaths;
es: use MisOperadores;

source: use Object::Tiny qw( path content last_mod_time );
es: use Object::Tiny qw( ruta contenido hora_ult_mod );

source: use Package 1.2 qw(some imported subs);
es: use Paquete 1.2 qw(algunas subrutinas importadas);

source: use Perl; provides a slashdot-style Perl news website covering all things Perl, from minutes of the meetings of the Perl 6 Design team to conference announcements with (ir)relevant discussion.
es: use Perl; ofrece un sitio web de noticias sobre Perl al estilo Slashdot que cubre todo lo relacionado con Perl, desde actas de las reuniones del equipo de diseño de Perl 6 hasta los anuncios de conferencias con discusiones (ir)relevantes.

source: use customre;
es: use rxpersonal;

source: use myint();
es: use entero();

source: use myint;
es: use entero;

source: use parent 'Father', 'Mother';
es: use parent 'Padre', 'Madre';

source: use parent 'File';
es: use parent 'Archivo';

source: use parent 'File'; # sets @File::MP3::ISA = ('File');
es: use parent 'Archivo'; # establece @Archivo::MP3::ISA = ('Archivo');

source: use parent 'Parent1', 'Parent2';
es: use parent 'Padre1', 'Padre2';

source: usually without needing to know which versions of perl to use as start and end revisions, as F<bisect.pl> automatically searches to find the earliest stable version for which the test case passes.
es: generalmente sin necesidad de saber qué versiones de perl hay que usar como revisiones inicial y final, ya que F<bisect.pl> buscará automáticamente la versión estable más reciente que supera el caso de prueba.

source: void $scalar SCALAR @array %hash
es: void $escalar SCALAR @array %hash
